console.log("Завдання: 2 ==============================");

// Створюємо функцію task2
function task2() {
  // Створюємо функцію promise1
	function promise1() {
  // Повертаємо новий проміс
		return new Promise((res, rej) => {
			// Використовуємо setTimeout для імітації асинхронної операції, яка завершується через 2 секунди.
			setTimeout(res, 2000, `Проміс 1 виконано`)
		})
	}
  // Після 2 секунд викликаємо resolve з результатом проміса, який є рядком "Проміс 1 виконано"

  // Створюємо функцію promise2
	function promise2() {
  // Повертаємо новий проміс
		return new Promise((res, rej) => {
  // Використовуємо setTimeout для імітації асинхронної операції, яка завершується через 5 секунди.
			setTimeout(res, 5000, `Проміс 2 виконано`)
		})
	}
  // Після 5 секунд викликаємо resolve з результатом проміса, який є рядком "Проміс 2 виконано"
	
	// Використовуємо Promise.race для визначення, який проміс виконується першим.
	// Метод повертає новий проміс, який вирішується або відхиляється негайно після розв'язання або відхилення будь-якого з промісів у переданому списку.
	Promise.race([promise1(), promise2()])
	// У разі успіху виводимо результат
		.then((data) => console.log(data))
  // У разі помилки виводимо повідомлення про помилку
		.catch((error) => console.error(error.message))
  // Незалежно від результату, виводимо повідомлення про завершення обробки промісів, який є рядом "Завдання 2 завершено"
		.finally(() => console.info(`Завдання 2 завершено`))
}

// Викликаємо функцію task2
task2();
