console.log("Завдання: 6 ==============================");

// Створюємо функцію task6, яка використовує setImmediate та проміси.
function task6() {
  // Створюємо новий проміс.
	new Promise((res, rej) => {
		setImmediate(() => {
			Math.random() < 0.5 ? res(`Більше ніж 0.5`) : rej(`Менше ніж 0.5`)
		})
	})
  // Використовуємо функцію setImmediate, щоб виконати функцію асинхронно.
  // Генеруємо випадкове число від 0 до 1
  // Якщо випадкове число менше 0.5, резолвимо проміс з рядком Більше ніж 0.5.
  // Інакше відхиляемо проміс з рядком Менше ніж 0.5 .
  // Використовуємо then для обробки зарезолвленого проміса, та виводимо `Проміс зарезолвився з значенням: ${value}`.
	.then((value) => { 
		console.log(`Проміс зарезолвився зi значенням: ${value}`)
	})
  // Якщо проміс відхилено, обробляємо помилку за допомогою catch, та виводимо `Проміс відхилився з помилкою: ${error}`.
	.catch((error) => {
		console.error(`Проміс відхилився з помилкою: ${error}`)
	}) 
  // Використовуємо finally для виконання дій після завершення проміса, незалежно від його статусу, та виводимо "Проміс завершено".
	.finally (() => {
		console.log(`Проміс завершено`)
	})
}

// Викликаємо функцію task6
task6();
